Revit 2027 API
FabricationPart.GetProductListEntryName Method
 Gets the specified product list entry name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetProductListEntryName(
	int index
)
Public Function GetProductListEntryName (
	index As Integer
) As String
public:
String^ GetProductListEntryName(
	int index
)
member GetProductListEntryName :
        index : int -> string
Parameters
index Int32
 The product entry index.
Return Value
String
 Returns the specified product entry name.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The product entry index is not larger than 0 and less than GetProductCount.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace